CREATE DATABASE  IF NOT EXISTS `dome1` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `dome1`;
-- MySQL dump 10.13  Distrib 8.0.12, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: dome1
-- ------------------------------------------------------
-- Server version	8.0.12

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `article`
--

DROP TABLE IF EXISTS `article`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `article` (
  `articleURL` varchar(250) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '文章URL',
  `title` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '文章标题',
  `preview` varchar(300) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '文章预览',
  `readership` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '阅读量',
  `hits` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '点赞数',
  `comments` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '评论数',
  `weight` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '权重',
  PRIMARY KEY (`articleURL`),
  UNIQUE KEY `articleURL_UNIQUE` (`articleURL`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `article`
--

LOCK TABLES `article` WRITE;
/*!40000 ALTER TABLE `article` DISABLE KEYS */;
INSERT INTO `article` VALUES ('path_01','银川市总工会2019年第二期“职工公益课堂”首期“每周一讲”开讲','7月5日，银川市总工会“职工大讲堂·每周一讲”首期公益讲座在市职工文化活动中心开讲，首期讲座邀请到了宁夏安全健康教育中心宣教科田彦国主任和银川爱尔眼科医院副院长哈文静主任医师两位专家现场授课，来自全市各机关企事业单位的200多名职工现场聆听。',6,3,0,1);
/*!40000 ALTER TABLE `article` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `databank`
--

DROP TABLE IF EXISTS `databank`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `databank` (
  `resourceURL` varchar(250) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '资源URL',
  `category` char(1) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '0' COMMENT '资源分类',
  `detail` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '资源内容',
  `limit` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '访问级别',
  `create_urzID` char(6) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '创建者ID',
  `create_time` datetime NOT NULL COMMENT '创建时间',
  `update_urzID` char(6) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '更新者ID',
  `update_time` datetime NOT NULL COMMENT '更新时间',
  `delFlag` char(1) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '0' COMMENT '逻辑删除',
  PRIMARY KEY (`resourceURL`),
  UNIQUE KEY `resourceURL_UNIQUE` (`resourceURL`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `databank`
--

LOCK TABLES `databank` WRITE;
/*!40000 ALTER TABLE `databank` DISABLE KEYS */;
INSERT INTO `databank` VALUES ('path_article01','1','7月5日，银川市总工会“职工大讲堂·每周一讲”首期公益讲座在市职工文化活动中心开讲，首期讲座邀请到了宁夏安全健康教育中心宣教科田彦国主任和银川爱尔眼科医院副院长哈文静主任医师两位专家现场授课，来自全市各机关企事业单位的200多名职工现场聆听。',0,'tester','2019-07-11 00:00:00','tester','2019-07-11 00:00:00','0');
/*!40000 ALTER TABLE `databank` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `sysinfo`
--

DROP TABLE IF EXISTS `sysinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `sysinfo` (
  `normID` char(8) CHARACTER SET utf8 COLLATE utf8_general_ci GENERATED ALWAYS AS (concat(`clazID`,`norm1`,`norm2`,`norm3`)) STORED NOT NULL COMMENT '编码ID',
  `clazID` char(2) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '00' COMMENT '分类ID',
  `claz_comment` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '分类注释',
  `norm1` char(2) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '00' COMMENT '编码1',
  `comment1` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '注释1',
  `norm2` char(2) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '00' COMMENT '编码2',
  `comment2` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '注释2',
  `norm3` char(2) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '00' COMMENT '编码3',
  `comment3` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '注释3',
  PRIMARY KEY (`normID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sysinfo`
--

LOCK TABLES `sysinfo` WRITE;
/*!40000 ALTER TABLE `sysinfo` DISABLE KEYS */;
INSERT INTO `sysinfo` (`clazID`, `claz_comment`, `norm1`, `comment1`, `norm2`, `comment2`, `norm3`, `comment3`) VALUES ,'00','分类元信息','01','板块','00','','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),'01','板块','01','新闻公告','00','','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),'01','板块','01','新闻公告','00','','00',''),'01','板块','01','新闻公告','01','部门要闻','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),'01','板块','01','新闻公告','00','','00',''),'01','板块','01','新闻公告','01','部门要闻','00',''),'01','板块','01','新闻公告','02','基层动态','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),'01','板块','01','新闻公告','00','','00',''),'01','板块','01','新闻公告','01','部门要闻','00',''),'01','板块','01','新闻公告','02','基层动态','00',''),'01','板块','01','新闻公告','03','党建纪检','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),'01','板块','01','新闻公告','00','','00',''),'01','板块','01','新闻公告','01','部门要闻','00',''),'01','板块','01','新闻公告','02','基层动态','00',''),'01','板块','01','新闻公告','03','党建纪检','00',''),'01','板块','01','新闻公告','04','图片新闻','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),'01','板块','01','新闻公告','00','','00',''),'01','板块','01','新闻公告','01','部门要闻','00',''),'01','板块','01','新闻公告','02','基层动态','00',''),'01','板块','01','新闻公告','03','党建纪检','00',''),'01','板块','01','新闻公告','04','图片新闻','00',''),'01','板块','02','学习强国','00','','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),'01','板块','01','新闻公告','00','','00',''),'01','板块','01','新闻公告','01','部门要闻','00',''),'01','板块','01','新闻公告','02','基层动态','00',''),'01','板块','01','新闻公告','03','党建纪检','00',''),'01','板块','01','新闻公告','04','图片新闻','00',''),'01','板块','02','学习强国','00','','00',''),'01','板块','03','业务工作','00','','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),'01','板块','01','新闻公告','00','','00',''),'01','板块','01','新闻公告','01','部门要闻','00',''),'01','板块','01','新闻公告','02','基层动态','00',''),'01','板块','01','新闻公告','03','党建纪检','00',''),'01','板块','01','新闻公告','04','图片新闻','00',''),'01','板块','02','学习强国','00','','00',''),'01','板块','03','业务工作','00','','00',''),'01','板块','04','资料中心','00','','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),'01','板块','01','新闻公告','00','','00',''),'01','板块','01','新闻公告','01','部门要闻','00',''),'01','板块','01','新闻公告','02','基层动态','00',''),'01','板块','01','新闻公告','03','党建纪检','00',''),'01','板块','01','新闻公告','04','图片新闻','00',''),'01','板块','02','学习强国','00','','00',''),'01','板块','03','业务工作','00','','00',''),'01','板块','04','资料中心','00','','00',''),'01','板块','04','资料中心','01','文件汇编','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),'01','板块','01','新闻公告','00','','00',''),'01','板块','01','新闻公告','01','部门要闻','00',''),'01','板块','01','新闻公告','02','基层动态','00',''),'01','板块','01','新闻公告','03','党建纪检','00',''),'01','板块','01','新闻公告','04','图片新闻','00',''),'01','板块','02','学习强国','00','','00',''),'01','板块','03','业务工作','00','','00',''),'01','板块','04','资料中心','00','','00',''),'01','板块','04','资料中心','01','文件汇编','00',''),'01','板块','04','资料中心','02','大事记','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),'01','板块','01','新闻公告','00','','00',''),'01','板块','01','新闻公告','01','部门要闻','00',''),'01','板块','01','新闻公告','02','基层动态','00',''),'01','板块','01','新闻公告','03','党建纪检','00',''),'01','板块','01','新闻公告','04','图片新闻','00',''),'01','板块','02','学习强国','00','','00',''),'01','板块','03','业务工作','00','','00',''),'01','板块','04','资料中心','00','','00',''),'01','板块','04','资料中心','01','文件汇编','00',''),'01','板块','04','资料中心','02','大事记','00',''),'01','板块','05','职工风采','00','','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),'01','板块','01','新闻公告','00','','00',''),'01','板块','01','新闻公告','01','部门要闻','00',''),'01','板块','01','新闻公告','02','基层动态','00',''),'01','板块','01','新闻公告','03','党建纪检','00',''),'01','板块','01','新闻公告','04','图片新闻','00',''),'01','板块','02','学习强国','00','','00',''),'01','板块','03','业务工作','00','','00',''),'01','板块','04','资料中心','00','','00',''),'01','板块','04','资料中心','01','文件汇编','00',''),'01','板块','04','资料中心','02','大事记','00',''),'01','板块','05','职工风采','00','','00',''),'01','板块','06','维权互助','00','','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),'01','板块','01','新闻公告','00','','00',''),'01','板块','01','新闻公告','01','部门要闻','00',''),'01','板块','01','新闻公告','02','基层动态','00',''),'01','板块','01','新闻公告','03','党建纪检','00',''),'01','板块','01','新闻公告','04','图片新闻','00',''),'01','板块','02','学习强国','00','','00',''),'01','板块','03','业务工作','00','','00',''),'01','板块','04','资料中心','00','','00',''),'01','板块','04','资料中心','01','文件汇编','00',''),'01','板块','04','资料中心','02','大事记','00',''),'01','板块','05','职工风采','00','','00',''),'01','板块','06','维权互助','00','','00',''),'01','板块','06','维权互助','01','最新消息','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),'01','板块','01','新闻公告','00','','00',''),'01','板块','01','新闻公告','01','部门要闻','00',''),'01','板块','01','新闻公告','02','基层动态','00',''),'01','板块','01','新闻公告','03','党建纪检','00',''),'01','板块','01','新闻公告','04','图片新闻','00',''),'01','板块','02','学习强国','00','','00',''),'01','板块','03','业务工作','00','','00',''),'01','板块','04','资料中心','00','','00',''),'01','板块','04','资料中心','01','文件汇编','00',''),'01','板块','04','资料中心','02','大事记','00',''),'01','板块','05','职工风采','00','','00',''),'01','板块','06','维权互助','00','','00',''),'01','板块','06','维权互助','01','最新消息','00',''),'01','板块','06','维权互助','02','办事指南','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),'01','板块','01','新闻公告','00','','00',''),'01','板块','01','新闻公告','01','部门要闻','00',''),'01','板块','01','新闻公告','02','基层动态','00',''),'01','板块','01','新闻公告','03','党建纪检','00',''),'01','板块','01','新闻公告','04','图片新闻','00',''),'01','板块','02','学习强国','00','','00',''),'01','板块','03','业务工作','00','','00',''),'01','板块','04','资料中心','00','','00',''),'01','板块','04','资料中心','01','文件汇编','00',''),'01','板块','04','资料中心','02','大事记','00',''),'01','板块','05','职工风采','00','','00',''),'01','板块','06','维权互助','00','','00',''),'01','板块','06','维权互助','01','最新消息','00',''),'01','板块','06','维权互助','02','办事指南','00',''),'01','板块','06','维权互助','03','用工信息','00',''),,'00','分类元信息','01','板块','00','','00',''),'00','分类元信息','02','部门','00','','00',''),'00','分类元信息','03','权限','00','','00',''),'00','分类元信息','04','权限','00','','00',''),'00','分类元信息','05','性别','00','','00',''),'00','分类元信息','06','政治面貌','00','','00',''),'00','分类元信息','07','职务','00','','00',''),'01','板块','01','新闻公告','00','','00',''),'01','板块','01','新闻公告','01','部门要闻','00',''),'01','板块','01','新闻公告','02','基层动态','00',''),'01','板块','01','新闻公告','03','党建纪检','00',''),'01','板块','01','新闻公告','04','图片新闻','00',''),'01','板块','02','学习强国','00','','00',''),'01','板块','03','业务工作','00','','00',''),'01','板块','04','资料中心','00','','00',''),'01','板块','04','资料中心','01','文件汇编','00',''),'01','板块','04','资料中心','02','大事记','00',''),'01','板块','05','职工风采','00','','00',''),'01','板块','06','维权互助','00','','00',''),'01','板块','06','维权互助','01','最新消息','00',''),'01','板块','06','维权互助','02','办事指南','00',''),'01','板块','06','维权互助','03','用工信息','00',''),'01','板块','07','职工天地','00','','00','');
/*!40000 ALTER TABLE `sysinfo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `urzinfo`
--

DROP TABLE IF EXISTS `urzinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `urzinfo` (
  `urzID` char(6) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '000000' COMMENT '用户ID',
  `permissions` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '登录权限',
  `accout` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '账号',
  `pazword` varchar(15) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '密码',
  `sex` char(1) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '0' COMMENT '性别',
  `age` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '年龄\n',
  `department` char(2) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '所属部门',
  `position` char(1) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '0' COMMENT '职务',
  `party` char(1) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '0' COMMENT '政治面貌',
  `hometown` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '籍贯',
  `mobile` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '电话',
  `email` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '邮箱',
  `address` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '联系地址',
  `signature` varchar(60) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '个性签名',
  `portraitURL` varchar(250) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '头像URL',
  PRIMARY KEY (`urzID`),
  UNIQUE KEY `urzID_UNIQUE` (`urzID`),
  UNIQUE KEY `accout_UNIQUE` (`accout`) /*!80000 INVISIBLE */
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `urzinfo`
--

LOCK TABLES `urzinfo` WRITE;
/*!40000 ALTER TABLE `urzinfo` DISABLE KEYS */;
INSERT INTO `urzinfo` VALUES ('666666',9,'666666','666666','1',18,'01','1','0','陕西','12345678901','666666@66.com','中国','个性签名',NULL);
/*!40000 ALTER TABLE `urzinfo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping events for database 'dome1'
--

--
-- Dumping routines for database 'dome1'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-07-11 21:08:17
